Revit 2024 API
RebarUpdateCurvesData.GetBendingRadius Method
 Gets the current bending radius of the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double GetBendingRadius()
Visual Basic
Public Function GetBendingRadius As Double
Visual C++
public:
double GetBendingRadius()
Return Value
 Returns the current bending radius of the rebar.
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace